EDT/УТ/src/Catalogs/МоделиОборудования/МоделиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиОборудования</name>
  <predefined>
    <items>
      <name>SIMКарта</name>
      <description>SIMКарта</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/СтатусыОборудования/СтатусыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОборудования</name>
    <type>
      <types>EnumRef.СтатусыЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/МоделиОборудования/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ТипОборудования");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Ссылка.Пустая() Тогда
		
		СменилиОборудование = (Ссылка.ТипОборудования <> ТипОборудования);
		
		Если ЕстьЗаписиВРС(Ссылка) И СменилиОборудование Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По данной модели ведётся учёт! Смена типа оборудования невозможна!";
			Сообщение.Поле = "ТипОборудования";
			Сообщение.Сообщить(); 
			
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ЕстьЗаписиВРС(МодельОборудования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОборудованияСрезПоследних.Период КАК Период,
		|	СтатусыОборудованияСрезПоследних.Регистратор КАК Регистратор,
		|	СтатусыОборудованияСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	СтатусыОборудованияСрезПоследних.Активность КАК Активность,
		|	СтатусыОборудованияСрезПоследних.Оборудование КАК Оборудование,
		|	СтатусыОборудованияСрезПоследних.Оборудование.МодельОборудования КАК Модель,
		|	СтатусыОборудованияСрезПоследних.СтатусОборудования КАК СтатусОборудования,
		|	СтатусыОборудованияСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СтатусыОборудования.СрезПоследних(, Оборудование.МодельОборудования = &МодельОборудования) КАК СтатусыОборудованияСрезПоследних";
	
	Запрос.УстановитьПараметр("МодельОборудования", МодельОборудования);
	
	РезультатЗапроса = Запрос.Выполнить();	

	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ()
